app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_url)
		if @article.save
---
INSERT INTO "articles" ("articleUrl", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["articleUrl", "wow"], ["status", "process"], ["created_at", "2017-07-13 09:52:40.788621"], ["updated_at", "2017-07-13 09:52:40.788621"]]

	def index
		checkSheetForChanges
		if params[:orderFilta]
			if params[:orderFilta][:filta] == 'all'
				@articles = Article.all()
---
SELECT "articles".* FROM "articles"